app/controllers/restaurantes_controller.rb

SELECT * FROM `restaurantes` ORDER BY nome
SELECT count(*) AS count_all FROM `restaurantes`
---
def index
 @restaurantes = Restaurante.paginate :page => params['page'], :per_page=>3

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`especialidade` = 'Comida Autraliana') LIMIT 1
---
def busca
  @restaurantes = []
  @restaurantes << Restaurante.find_by_especialidade(params[:especialidade])

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 7)
---
def show
  @restaurante = Restaurante.find(params[:id])

INSERT INTO `restaurantes` (`updated_at`, `especialidade`, `endereco`, `nome`, `created_at`) VALUES('2010-05-13 21:55:18', 'Costela', 'Vila Madalena', 'O Patriarca', '2010-05-13 21:55:18')
---
def create
  @restaurante = Restaurante.new(params[:restaurante])
  if @restaurante.save

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 7)
---
def edit
  @restaurante = Restaurante.find(params[:id])

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 7)
UPDATE `restaurantes` SET `nome` = 'Restaurante Da Bia', `endereco` = 'kkkk', `especialidade` = '', `updated_at` = '2010-05-11 01:09:11' WHERE `id` = 7
---
def update
  @restaurante = Restaurante.find(params[:id])
  if @restaurante.update_attributes(params[:restaurante])

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 4)
DELETE FROM `restaurantes` WHERE `id` = 4
---
def destroy
  flash[:notice] = 'Excluido com Sucesso ! '
  @restaurante = Restaurante.find(params[:id])
  @restaurante.destroy